{
    "code": "Aqua",
    "full_name": "Marinus Draconis",
    "first_name": "Marinus",
    "last_name": "Draconis",
    "title": "the Aquatic Paladin",
    "bastion_name": "Dragnoel",
    "bastion_full": "Dragnoel, the Dragon Knights",
    "bastion_short": "dragnoel",
    "race": "Dragonian",
    "soulforge": "Ocean Breaker",
    "resonance": "Water Bending",
    "intro": "When the Primordial Dragon fell, its soul was shattered into six fragments of avatars that would later be referred to as the Dragon Knights, or the Draconis siblings. Marinus is the fourth sibling, wielding the elemental power of water. She commands the crushing weight of the ocean to drown her enemies, eventually ascending into a draconic form of living water to obliterate those who stand in her way.",
    "abilities": [
        {
            "name": "Abyssal Depth",
            "details": "Marinus gains bonus <span class=\"ability-ap\">magic penetration</span> based on her <span class=\"ability-mp\">maximum mana</span>.<br><br>A percentage of Marinus's bonus <span class=\"ability-ap\">magical power</span> is converted into <span class=\"ability-mp\">maximum mana</span>."
        },
        {
            "name": "Hydro Pump",
            "details": "Marinus channels a high-pressure beam of water in a straight line that impacts the first enemy hit, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-mp\">maximum mana</span>) every quarter second.<br><br>While casting, Marinus is grounded (cannot move) but can rotate her direction. This ability can be held down to continue the blast, rapidly consuming her <span class=\"ability-mp\">mana</span> per second.<br><br>In <strong>Aqua Dragon</strong> form, the beam becomes a powerful torrent, gaining extra range and dealing additional bonus magical damage based on the target's maximum health (scaling with <span class=\"ability-mp\">maximum mana</span>)."
        },
        {
            "name": "Riptide Vortex",
            "details": "Marinus creates a swirling vortex at a target location. After a short delay, the vortex deals <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-mp\">maximum mana</span>) per second and constantly <span class=\"ability-debuff\">pulls</span> them toward its center.<br><br>In <strong>Aqua Dragon</strong> form, the vortex is larger and enemies will also be <span class=\"ability-debuff\">grounded</span>."
        },
        {
            "name": "Tidal Surge",
            "details": "Marinus sends a crashing tidal wave in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-mp\">maximum mana</span>) to all enemies hit and <span class=\"ability-debuff\">slowing</span> them for a short duration.<br><br>In <strong>Aqua Dragon</strong> form, the wave is significantly <span class=\"ability-debuff\">wider</span> and also <span class=\"ability-debuff\">knocks up</span> enemies instead of slowing them."
        },
        {
            "name": "Ocean Breaker",
            "details": "Marinus surges with primal energy, transforming into the <strong>Aqua Dragon</span> for a duration, gaining increased <span class=\"ability-mp\">maximum mana</span> and <span class=\"ability-mp\">mana regen</span>.<br><br>In addition, <strong>Ocean Breaker</strong> also <span class=\"ability-buff\">recovers</span> a percentage of her maximum mana on cast. While in <strong>Aqua Dragon</strong> form, her abilities are enhanced."
        }
    ]
}
