{
    "code": "Blade",
    "full_name": "Arcian Truthsteel",
    "first_name": "Arcian",
    "last_name": "Truthsteel",
    "title": "the Abyssal Demon",
    "bastion_name": "Custodians",
    "bastion_full": "Custodians (Protagonists)",
    "bastion_short": "custodians",
    "race": "Slaryn",
    "soulforge": "Monochrome",
    "resonance": "Primal Destruction",
    "intro": "Originally a Templar from Everlight, the Bastion of the Valorians, Arcian was exiled when he destroyed one of the five noble houses, Skyforge and killed their Pillar. His Soulforge, Monochrome, grants him the ability to remove the colour of all matters, rendering all other abilities useless. This ability can be molded into any shape, which he often uses for his cloak, wolf and all the blades that he carries. Each blade is crafted from a formidable opponent that he has faced, and the most dangerous one is the rumoured crimson blade which also carries the millions of souls whom entrusted their faith in him.",
    "abilities": [
        {
            "name": "Monochrome Blade",
            "details": "Arcian's basic attacks generates a stack of <span>Monochrome Blade</span>, stacking up to three times.<br><br>The third stack empowers his basic attack to deal bonus <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ad\">physical power</span> and <span class=\"ability-ap\">magical power</span>), and <span class=\"ability-debuff\">steals</span> a small amount of the target's <span class=\"ability-mp\">mana</span>."
        },
        {
            "name": "Phantom Slash",
            "details": "Arcian slashes twice at a target, each dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>). Each hit is counted as a basic attack."
        },
        {
            "name": "Spectral Arsenal",
            "details": "Arcian periodically crafts a <span>Spectral Blade</span>, up to a maximum of three can be stored at a time. Each <span>Spectral Blade</span> grants him bonus <span class=\"ability-buff\">physical power</span> (scaling with <span class=\"ability-ad\">physical power</span>).<br><br>Arcian can cast this ability to manifest one <span>Spectral Blade</span> at the target location."
        },
        {
            "name": "Void Steps",
            "details": "Arcian shifts to a manifested <span>Spectral Blade</span> on the ground, then empowers his next basic attack to blink to the enemy target, dealing bonus <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>)"
        },
        {
            "name": "Oblivion's Decree",
            "details": "Arcian enters a heightened state for several seconds, gaining bonus <span class=\"ability-mv\">movement speed</span> and <span class=\"ability-as\">attack speed</span>.<br><br>During this state, Arcian replaces his <span>Monochrome Blade</span> with the <span>Oblivion Blade</span>, making his third basic attack deals <span class=\"ability-td\">true damage</span> instead of magical damage, and briefly <span class=\"ability-debuff\">silences</span> the target instead of stealing mana.<br><br>The same enemy hero cannot be silenced twice during each <span>Oblivion's Decree</span>, and will become vulnerable to mana steal again after the first silence."
        }
    ],
    "config": {
        "char_width": 1080,
        "char_height": 860,
        "next_char": "justice"
    }
}
