{
    "code": "Crimson",
    "full_name": "Nocturne",
    "first_name": "Nocturne",
    "last_name": "",
    "title": "the Monarch of Blood",
    "bastion_full": "Nether, the Hellish Monarchs",
    "bastion_name": "Nether",
    "bastion_short": "nether",
    "race": "Hellspawn",
    "soulforge": "?",
    "resonance": "Blood Manipulation",
    "intro": "",
    "abilities": [
        {
            "name": "Blood Pool",
            "details": "When Nocturne kills an enemy with any of his abilities, he increases his <span class=\"ability-hp\">maximum health</span> by a small amount permanently. Large minions, monsters and heroes' kills grant larger increase.<br><br>Nocturne uses his <span class=\"ability-debuff\">health</span> to cast abilities instead of mana."
        },
        {
            "name": "Vampiric Drain",
            "details": "On <strong>Sword</strong> form, Nocturne stabs in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>) to all enemies hit and <span class=\"ability-buff\">healing</span> himself (scaling with <span class=\"ability-ap\">magical power</span> plus a percentage of his <span class=\"ability-hp\">missing health</span>).<br><br>On <strong>Staff</strong> form, Nocturne drains the blood from a target enemy for the next few seconds, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>) and <span class=\"ability-buff\">heals</span> himself (scaling with <span class=\"ability-ap\">magical power</span>). In addition, he also gains increased <span class=\"ability-ms\">movement speed</span> during the cast."
        },
        {
            "name": "Sanguine Sword / Sanguine Staff",
            "details": "Nocturne shapeshifts his weapon into either a sword or a staff, gaining different abilities.<br><br>When switching to <strong>Sword</strong> form, his basic attack becomes shorter range but deals additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>). In addition, his first basic attack within the first few seconds after shapeshifting will briefly <span class=\"ability-debuff\">slow</span> the target.<br><br>When switching to <strong>Staff</strong> form, his basic attack gains additional <span class=\"ability-buff\">range</span>. In addition, his first basic attack within the first few seconds after shapeshifting deals additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and reduces the target’s <span class=\"ability-debuff\">magical resistance</span>."
        },
        {
            "name": "Death Grasp",
            "details": "On <strong>Sword</strong> form, Nocturne dashes in a target direction and sends out a claw, pulling the first enemy hit to him and dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>).<br><br>On <strong>Staff</strong> form, Nocturne summons a claw in a target direction, pulling all enemies within the path towards him and dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>)."
        },
        {
            "name": "Night Feast",
            "details": "Nocturne channels for a second then sends out a number of <strong>Blood Bat</strong> each second for the next few seconds. Each <strong>Blood Bat</strong> will attack a nearby enemy, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and <span class=\"ability-hp\">maximum health</span>).<br><br>On <strong>Sword</strong> form, each <strong>Blood Bat</strong> will return after each attack to <span class=\"ability-buff\">heal</span> (scaling with <span class=\"ability-hp\">maximum health</span>) him.<br><br>On <strong>Staff</strong> form, each <strong>Blood Bat</strong> will explode upon contact, dealing additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and briefly <span class=\"ability-debuff\">fearing</span> the target. Each target can only be feared once during the <strong>Night Feast</strong>.<br><br>Blood Bat will prioritise enemy heroes first, then closer enemies."
        }
    ]
}
