{
    "code": "Earth",
    "full_name": "Terros Draconis",
    "first_name": "Terros",
    "last_name": "Draconis",
    "title": "the Iron Vanguard",
    "bastion_name": "Dragnoel",
    "bastion_full": "Dragnoel, the Dragon Knights",
    "bastion_short": "dragnoel",
    "race": "Dragonian",
    "soulforge": "Earth Breaker",
    "resonance": "Earth Bending",
    "intro": "When the Primordial Dragon fell, its soul was shattered into six fragments of avatars that would later be referred to as the Dragon Knights, or the Draconis siblings. Terros is the second sibling, wielding the elemental power of earth and metal. He spends most of his time at the bastion, which he built all on his own over decades. He believes his primary duty of the siblings is not only to rule their people with an iron fist, but also to protect them with an iron wall.",
    "abilities": [
        {
            "name": "Iron Armour",
            "details": "Terros builds up layers of iron on his armour when not in combat, granting bonus <span class=\"ability-ar\">physical resistance</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) each layer (maximum 5 layers).<br><br>Each time Terros takes physical damage, a layer will be destroyed and Terros will gain increased <span class=\"ability-ms\">movement speed</span> for a short duration. The movement speed boost can be stacked."
        },
        {
            "name": "Colossal Smash",
            "details": "Terros winds up his hammer and then smashes the ground, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) in a target direction and briefly <span class=\"ability-debuff\">slowing</span> all enemies hit.<br><br>In addition, 1 <strong>Iron Pillar</strong> will rise up at the end of the skill range, <span class=\"ability-debuff\">obstructing all units' movement</span>.<br><br>Using this ability reduce Terros's <span class=\"ability-debuff\">physical resistance</span> until the <strong>Iron Pillars</strong> shatter (each <strong>Iron Pillar</strong> reduces Terros's <span class=\"ability-debuff\">physical resistance</span> separately.). The <strong>Iron Pillars</strong> will shatter after a few seconds or when interacted with Terros's other abilities.<br><br>Each of the <strong>Iron Pillars</strong> has 3 bars of health points. There will only be a maximum of 3 <strong>Iron Pillars</strong> on the ground.<br><br>In <strong>Earth Dragon</strong> form, <strong>Colossal Smash</strong> becomes a cone-shaped area instead, and 3 <strong>Iron Pillars</strong> will be created instead of one."
        },
        {
            "name": "Ferric Storm",
            "details": "Terros creates floating iron shards around himself, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) to nearby enemies and reducing their <span class=\"ability-debuff\">attack speed</span>.<br><br>Terros can recast this ability to recall the shards back to his armour, granting himself a <span class=\"ability-sh\">shield</span> (scaling with <span class=\"ability-ar\">physical resistance</span>).<br><br>If one or more <strong>Iron Pillars</strong> are present, Terros will shatter them during the recast to immediately recover his physical resistance stats and gains an even stronger shield based on the number of <strong>Iron Pillars</strong> shattered.<br><br>In <strong>Earth Dragon</strong> form, <strong>Ferric Storm</strong> also reduces nearby enemies' <span class=\"ability-debuff\">physical resistance</strong>."
        },
        {
            "name": "Heavy Slam",
            "details": "Terros charges at a target direction, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) to the first enemy hero hit and <span class=\"ability-debuff\">pushing</span> the target back along the way.<br><br>If the target is slammed into the <strong>Iron Pillars</strong>, it will shatter the pillars, taking <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) and getting <span class=\"ability-debuff\">stunned</span> for a short duration.<br><br>Slamming the enemy into a terrain will stop the charge, deal less damage and they will be <span class=\"ability-debuff\">slowed</span> instead of stunned.<br><br>In <strong>Earth Dragon</strong> form, <strong>Heavy Slam</strong> can push multiple enemies at once."
        },
        {
            "name": "Earth Breaker",
            "details": "Terros channels his power to unleash his dragon form. When unleashed, Terros becomes the powerful <strong>Earth Dragon</strong>, gaining increased <span class=\"ability-ar\">physical resistance</span>, <span class=\"ability-buff\">size</span> and <span class=\"ability-buff\">attack range</span>, while sending out a wave of rupture that deals <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) and <span class=\"ability-debuff\">knocks up</span> enemies upon contact.<br><br>When the wave of rupture touches the <strong>Iron Pillars</strong>, it will shatter them, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) to surrouding enemies and briefly <span class=\"ability-debuff\">stunning</span> them.<br><br>If the enemies have already been knocked up, the stun effect takes place after the target lands. If the enemies stand behind the <strong>Iron Pillars</strong>, they will not be knocked up because the rupture wave would have stopped at the pillars. However, they can still be stunned when the <strong>Iron Pillars</strong> shatter if they stand too close.<br><br>While in <strong>Earth Dragon</strong> form, his abilities are enhanced."
        }
    ],
    "config": {
        "prev_char": "wood",
        "next_char": "wind"
    }
}
