{
    "alias": "Elementalist",
    "name": "Ciarra Crownsworth",
    "bastion": "Everlight, the Dawn Bringers",
    "bastion_short": "everlight",
    "role": "Mage",
    "class": "Burst",
    "position": "Mid",
    "type": "Magical",
    "range": "Ranged",
    "abilities": [
        {
            "name": "Elementalist",
            "details": "As a master of all elements, Ciarra's abilities will alternate between <b>Arcane Mode</b> and <b>Mystic Mode</b>. In <b>Arcane Mode</b>, her abilities will focus on protection and area control, while in <b>Mystic Mode</b>, they will focus on magic damage.[n]When Ciarra uses her ability, she will fill up her <b>Elemental Gauge</b>. When the gauge is full, she will automatically switch to the other mode.[n]<b>Arcane Mode:</b> Ciarra will recover a small percentage of her [mp]missing mana[/] every second.[n]<b>Mystic Mode:</b> her abilities will deal additional [ap]magical damage[/] (scaling with [ap]magical power[/])."
        },
        {
            "name": "Arcanic Stone / Mystical Flare",
            "details": "<b>Arcane Mode</b>: Ciarra will cast a sharp stone in a target direction, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) to the first enemy hit. The stone will shatter upon impact and deal lesser magical damage to the enemies behind.[n]<b>Mystic Mode</b>: Ciarra will cast a blast of fire in a target direction, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) to all enemies in a small radius around the first enemy hit. "
        },
        {
            "name": "Arcanic Ice / Mystical Bolt",
            "details": "<b>Arcane Mode</b>: Ciarra will summon a blizzard in a target area, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) and [db]slowing[/] all enemies inside.[n]<b>Mystic Mode</b>: Ciarra will cast a lightning bolt that strike in a target area after a short delay, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) and reducing their [mr]resistance[/]."
        },
        {
            "name": "Arcanic Gale / Mystical Flora",
            "details": "<b>Arcane Mode</b>: Ciarra will cast a wind gale on a target path, increasing her and allies' [ms]movement speed[/] for a short duration.[n]<b>Mystic Mode</b>: Ciarra will summon several sprouts on a target path. After a short duration, they will grow into thorns and grab onto all enemies within the area, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) and [db]rooting[/] them down for a short duration."
        },
        {
            "name": "Arcanic Light / Mystical Void",
            "details": "<b>Arcane Mode</b>: Ciarra will cast a field of light around herself, pushing all enemies out of the field and stopping all enemies who attempt to dash into or within the field. If a target is successfully interrupted, they will be dealt [ap]magical damage[/] (scaling with [ap]magical power[/]) and [db]knocked up[/] for a brief duration.[n]<b>Mystic Mode</b>: Ciarra will cast a shroud of darkness at a target area that constantly deals [ap]magical damage[/] (scaling with [ap]magical power[/]) for several seconds. The shroud will slowly [db]expand, reducing vision[/] of all enemies within."
        }
    ],
    "config": {
        "char_width": 1100,
        "char_height": 840,
        "background": true,
        "prev_char": "elderpost",
        "next_char": "emberheart"
    }
}
