{
    "code": "Forge",
    "full_name": "Kharra-Ryn",
    "first_name": "Kharra-Ryn",
    "last_name": "",
    "title": "the Sun Carver",
    "bastion_name": "Durak-Tharn",
    "bastion_full": "Durak-Tharn, the Hearth Forgers",
    "bastion_short": "duraktharn",
    "race": "Dovaran",
    "soulforge": "?",
    "resonance": "?",
    "intro": "Coming soon.",
    "abilities": [
        {
            "name": "Living Forge",
            "details": "Kharra-Ryn carries the heart of a forge within her, allowing her to aid her allies' progression by contributing her own gold to their item purchases. Once every few minutes, Kharra-Ryn can <span>select an allied hero</span> and <span>choose an item</span> they are currently building. She can then spend a portion of <span class=\"ability-ar\">her own gold</span> to <span class=\"ability-buff\">contribute to that item's cost</span>.<br><br>Her gold contribution is added a small <span class=\"ability-ar\">bonus</span> when contributed to the ally's item completion progress, effectively giving her a personal reduced cost on the upgrade."
        },
        {
            "name": "Golden Hammer",
            "details": "Kharra-Ryn hurls her enchanted golden hammer, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) to the first enemy hit, briefly slowing down the target and reducing their <span class=\"ability-ad\">physical power</span> for a few seconds."
        },
        {
            "name": "Molten Impact",
            "details": "Kharra-Ryn imbues her hammer with solar energy, causing her next three basic attacks within a few seconds to deal bonus <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-hp\">health</span>) and apply a stack of <span>Molten Impact</span> to the target.<br><br>Upon reaching three <span>Molten Impact</span> stacks, the target is dealt <span class=\"ability-ap\">magical damage</span> (scaling with the target's <span class=\"ability-hp\">health</span>) and gets <span class=\"ability-debuff\">stunned</span> for a short duration. The stacks are then removed and can be replied again after a short cooldowns per target."
        },
        {
            "name": "Power Strike",
            "details": "Kharra-Ryn slams her hammer at a target enemy, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) and <span class=\"ability-debuff\">knocks back</span> the target.<br><br>Enemies that collide with the knocked back target take the same physical damage and are briefly <span class=\"ability-debuff\">stunned</span>."
        },
        {
            "name": "Smelting Core",
            "details": "Kharra-Ryn launches a heavy, glowing smelting core to a target location within a long range. Upon landing, the core deals <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) in an area, greatly slowing all enemies hit and reducing their physical resistance for few seconds."
        }
    ]
}
