{
    "code": "Frost",
    "full_name": "Fenrir Vánagandr",
    "first_name": "Fenrir",
    "last_name": "Vánagandr",
    "title": "the Glacial Ravager",
    "bastion_full": "Jötunheimr, the Winter Hounds",
    "bastion_name": "Jötunheimr",
    "race": "Jötunn",
    "soulforge": "?",
    "resonance": "Frost Armour",
    "intro": "Fenrir Vánagandr is a cursed guardian of the high peaks of Jötunheimr. Neither fully giant nor fully beast, he stalks the blizzard-choked passes, hunting those who dare trespass on the sacred frost. He doesn't just kill his prey; he freezes their blood in their veins until they can no longer lift their weapons to resist.",
    "abilities": [
        {
            "name": "Frost Armour",
            "details": "Fenrir generates a layer of frost over his fur every now and then. This armour grants him a <span class=\"ability-ar\">flat damage reduction</span> against <span class=\"ability-ar\">basic attacks</span> and minor <span class=\"ability-mr\">magic resistance</span>.<br><br>When Fenrir is hit by three basic attacks or a displacement effect by an enemy hero, it shatters, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to nearby enemies and applying three stacks of <strong>Frost</strong>.<br><br>Enemies with <strong>Frost</strong> have their <span class=\"ability-debuff\">movement speed</span> reduced, stacking up to eight times."
        },
        {
            "name": "Glacial Slash",
            "details": "Fenrir slashes his claws in front of him, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ad\">physical power</span> and <span class=\"ability-ap\">magical power</span>) and applying two additional stacks of <strong>Frost</strong> on the target.<br><br>If the target has five or more stacks, this ability <span class=\"ability-buff\">heals</span> Fenrir for a portion of his missing health.<br><br>If the target has eight stacks, this ability deals additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span> and target's <span class=\"ability-debuff\">maximum health</span>)."
        },
        {
            "name": "Boreal Breath",
            "details": "Fenrir exhales a blast of freezing wind in a cone for a short duration.<br><br>Enemies caught in the breath take <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) every half of second and have their <span class=\"ability-debuff\">attack speed</span> reduced.<br><br>Each tick of damage also applies a stack of <strong>Frost</strong> (up to three stacks per ability's full duration)."
        },
        {
            "name": "Snow Ball",
            "details": "Fenrir conjures a snowball that rolls in a target direction. As it travels, it grows in size, increasing its damage and impact radius.<br><br>Upon contact with an enemy hero, it explodes, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ad\">physical power</span> and <span class=\"ability-ap\">magical power</span>) and <span class=\"ability-debuff\">knocking up</span> enemies hit."
        },
        {
            "name": "Winter Is Coming",
            "details": "Fenrir lets out a blood-curdling howl, causing a localised blizzard to swirl around him for a duration, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and applying a stack of <strong>Frost</strong> per tick of damage (up to twelve stacks per ability's full duration).<br><br>In addition, he gains increased <span class=\"ability-buff\">size</span>, <span class=\"ability-buff\">range</span> and his <strong>Frost Armour</strong> cannot be shattered (if Fenrir does not currently have <strong>Frost Armour</strong>, using this ability instantly grants him the armour)."
        }
    ]
}
