{
    "code": "Ignite",
    "full_name": "Eris Flameheart",
    "first_name": "Eris",
    "last_name": "Flameheart",
    "title": "the Scarlet Flame",
    "bastion_name": "Everlight",
    "bastion_full": "Everlight, the Dawn Bringers",
    "bastion_short": "everlight",
    "race": "Valorian",
    "soulforge": "Ignis",
    "resonance": "Flame Manipulation",
    "intro": "Prodigy of the Flameheart House, one of the five noble houses of Everlight, Eris is famous for weaving her fire flag and dancing through the battlefield, hence, earning her the nickname of the Scarlet Flame. Since birth, she was assigned to be the personal guard of the youngest daughter of the Everlight's Paragon, Ciarra Crownsworth. They grew up together and became best friends. Eris later on joined Ciarra and the others to create the Seventh Order of Everlight, where she continued to shine through her talent and became one of the strongest flame masters in the world.",
    "abilities": [
        {
            "name": "Unwavering Faith",
            "details": "While out of combat, Eris gains <span class=\"ability-buff\">increased movement speed</span>. Upon entering combat with an enemy hero (by dealing or taking damage from them), Eris's next basic attack within a few seconds deals bonus <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and briefly grants her a burst of <span class=\"ability-buff\">tenacity</span>."
        },
        {
            "name": "Flaming Sweep",
            "details": "Eris's next three basic attacks sweeps her fire banner in a wide arc, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies around her.<br><br>If Eris is within her active <span>Fiery Rally</span> banner's radius, her enhanced basic attacks will deal additional <span class=\"ability-ap\">magical damage</span> based on the target's <span class=\"ability-hp\">current health</span>."
        },
        {
            "name": "Fiery Rally",
            "details": "Eris plants down her <span>Sacred Banner</span>, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all nearby enemies. The planted banner radiates an aura, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) per second for a few seconds.<br><br>All allied heroes standing within its radius (including Eris) will be granted bonus <span class=\"ability-buff\">physical and magical power</span>."
        },
        {
            "name": "Zealous Charge",
            "details": "Eris dashes a short distance in a target direction. If Eris lands within the radius of her active <span>Fiery Rally</span> banner, the banner emits a pulse, dealing bonus <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to nearby enemies while also granting her and all allied heroes a shield (scaling with <span class=\"ability-ap\">magical power</span>) for a few seconds.<br><br>The shield can only be granted once per <span>Fiery Rally</span> banner duration. In addition, casting <span>Fiery Rally</span> resets the cooldowns of <span>Zealous Charge</span>."
        },
        {
            "name": "Holy Conflagration",
            "details": "Eris's <span>Sacred Banner</span> releases a fiery vortex that deals <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies caught within and greatly <span class=\"ability-debuff\">slowing</span> them.<br><br>Casting <span>Holy Conflagration</span> refreshes the duration of her active <span>Fiery Rally</span> banner. However, it will not refresh the ability to grant a shield as it's still counted as a single duration."
        }
    ],
    "config": {
        "char_height": 860
    }
}
