{
    "code": "Iron",
    "full_name": "Argon Draconis",
    "first_name": "Argon",
    "last_name": "Draconis",
    "title": "the Iron Vanguard",
    "bastion_name": "Dragnoel",
    "bastion_full": "Dragnoel, the Dragon Knights",
    "bastion_short": "dragnoel",
    "race": "Dragonian",
    "soulforge": "Earthbreaker",
    "resonance": "Iron Bending",
    "intro": "When the Primordial Dragon fell, its soul was shattered into six fragments of avatars that would later be referred to as the Dragon Knights, or the Draconis siblings. Argon is the second sibling, wielding the elemental power of earth and metal. He spends most of his time at the bastion, which he built all on his own over decades. He believes his primary duty of the siblings is not only to rule their people with an iron fist, but also to protect them with an iron wall.",
    "abilities": [
        {
            "name": "Iron Armour",
            "details": "Argon builds up layers of iron on his armour when not in combat, granting bonus <span class=\"ability-ar\">physical resistance</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) each layer (maximum <span>five</span> layers).<br><br>Each time Argon takes physical damage, a layer will be destroyed and Argon will gain <span class=\"ability-buff\">increased movement speed</span> for a short duration. The movement speed boost can be stacked."
        },
        {
            "name": "Colossal Smash",
            "details": "Argon winds up his hammer and then smashes the ground, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) in a cone-shaped area and briefly slowing all enemies hit.<br><br>In addition, three <span>Iron Pillars</span> will rise up at the end of the cone, <span class=\"ability-debuff\">obstructing all units' movement</span>.<br><br>Using this ability <span class=\"ability-debuff\">reduce</span> Argon's <span class=\"ability-ar\">physical resistance</span> until the <span>Iron Pillars</span> shatter (each <span>Iron Pillar</span> reduces Argon's <span class=\"ability-ar\">physical resistance</span> separately.). The <span>Iron Pillars</span> will shatter after a few seconds or when interacted with Argon's other abilities.<br><br>Each of the <span>Iron Pillars<span> has three bars of health points. There will only be a maximum of three <span>Iron Pillars</span> on the ground."
        },
        {
            "name": "Ferric Storm",
            "details": "Argon creates floating iron shards around himself, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) to nearby enemies and <span class=\"ability-debuff\">reducing their attack speed</span>.<br><br>Argon can recast this ability to recall the shards back to his armour, granting himself a <span class=\"ability-hp\">shield</span> (scaling with <span class=\"ability-ar\">physical resistance</span>).<br><br>If one or more <span>Iron Pillars</span> are present, Argon will shatter them during the recast to immediately recover his physical resistance stats and gains an even stronger shield based on the number of <span>Iron Pillars</span> shattered."
        },
        {
            "name": "Heavy Slam",
            "details": "Argon charges at a target direction, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) to all enemies hit and <span class=\"ability-debuff\">pushing</span> them back along the way.<br><br>If enemies are slammed into the <span>Iron Pillars</span>, they will shatter the pillars, taking <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) and getting <span class=\"ability-debuff\">stunned</span> for a short duration.<br><br>Slamming the enemies into a terrain will stop the charge, deal less damage and they will be <span class=\"ability-debuff\">slowed</span> instead of stunned."
        },
        {
            "name": "Earth Breaker",
            "details": "Argon channels his power to prepare a powerful attack. When unleashed, Argon smashes the ground, sending out a wave of rupture that deals <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) and <span class=\"ability-debuff\">knocks up</span> enemies upon contact. The longer he charges the attack, the further the wave travels and the more damage it deals.<br><br>When the wave of rupture touches the <span>Iron Pillars</span>, it will shatter them, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ar\">physical resistance</span>) to surrouding enemies and briefly <span class=\"ability-debuff\">stunning</span> them. If the enemies have already been knocked up, the stun effect takes place after the target lands.<br><br>Argon can still move while channeling his power, but will be slightly slower.<br><br>If the enemies stand behind the <span>Iron Pillars</span>, they will not be knocked up because the rupture wave would have stopped at the pillars. However, they can still be stunned when the <span>Iron Pillars</span> shatter if they stand too close."
        }
    ]
}
