{
    "alias": "Ironbound",
    "name": "Ar-Gon",
    "bastion_name": "Durak-Tharn",
    "bastion_full": "Durak-Tharn, the Hearth Forgers",
    "bastion_short": "duraktharn",
    "role": "Tank",
    "class": "Vanguard",
    "type": "Physical",
    "range": "Melee",
    "abilities": [
        {
            "name": "Iron Armour",
            "details": "Ar-Gon builds up layers of iron on his armour when not in combat, granting bonus [ar]physical resistance[/] (scaling with [ar]physical resistance[/]) each layer (maximum 5 layers).[n]Each time Ar-Gon takes physical damage, a layer will be destroyed and Ar-Gon will gain increased [ms]movement speed[/] for a short duration. The movement speed boost can be stacked."
        },
        {
            "name": "Colossal Smash",
            "details": "Ar-Gon winds up his hammer and then smashes the ground, dealing [ad]physical damage[/] (scaling with [ar]attack damage[/]) in a cone and briefly [db]slowing[/] all enemies hit.[n]In addition, 3 <b>Iron Pillar</b> will rise up at the end of the skill range, [db]obstructing all units' movement[/].[n]Using this ability reduce Ar-Gon's [db]physical resistance[/] until the <b>Iron Pillars</b> shatter (each <b>Iron Pillar</b> reduces Ar-Gon's [db]physical resistance[/] separately.). The <b>Iron Pillars</b> will shatter after a few seconds or when interacted with Ar-Gon's other abilities.[n]Each of the <b>Iron Pillars</b> has 3 bars of health points. There will only be a maximum of 3 <b>Iron Pillars</b> on the ground."
        },
        {
            "name": "Ferric Storm",
            "details": "Ar-Gon creates floating iron shards around himself, dealing [ad]physical damage[/] (scaling with [ar]physical resistance[/]) to nearby enemies and reducing their [db]attack speed[/].[n]Ar-Gon can recast this ability to recall the shards back to his armour, granting himself a [sh]physical shield[/] (scaling with [ar]physical resistance[/]).[n]If one or more <b>Iron Pillars</b> are present, Ar-Gon will shatter them during the recast to immediately recover his physical resistance stats and gains an even stronger shield based on the number of <b>Iron Pillars</b> shattered."
        },
        {
            "name": "Heavy Slam",
            "details": "Ar-Gon slams his hammer at the target enemy, dealing [ad]physical damage[/] (scaling with [ad]physical [power][/]) and [db]knocking[/] the target back.[n]If the target is slammed into the <b>Iron Pillars</b>, it will shatter the pillars, taking [ad]physical damage[/] (scaling with [ar]physical resistance[/]) and getting [db]stunned[/] for a short duration.[n]Slamming the enemy into a terrain will deal less damage and they will be [db]slowed[/] instead of stunned."
        },
        {
            "name": "Earth Breaker",
            "details": "Ar-Gon channels his power to prepare a powerful attack. When unleashed, Ar-Gon smashes the ground, sending out a wave of rupture that deals [ad]physical damage[/] (scaling with [ad]physical power[/]) and [db]knocks up[/] enemies upon contact.[n]When the wave of rupture touches the <b>Iron Pillars</b>, it will shatter them, dealing [ad]physical damage[/] (scaling with [ar]physical resistance[/]) to surrouding enemies and briefly [db]stunning[/] them.[n]If the enemies have already been knocked up, the stun effect takes place after the target lands. If the enemies stand behind the <b>Iron Pillars</b>, they will not be knocked up because the rupture wave would have stopped at the pillars. However, they can still be stunned when the <b>Iron Pillars</b> shatter if they stand too close."
        }
    ],
    "config": {
        "prev_char": "soulforger",
        "next_char": "colossus"
    }
}