{
    "code": "Mystic",
    "full_name": "Ciarra Crownsworth",
    "first_name": "Ciarra",
    "last_name": "Crownsworth",
    "title": "the Elemental Master",
    "bastion_name": "Everlight",
    "bastion_full": "Everlight, the Dawn Bringers",
    "bastion_short": "everlight",
    "race": "Valorian",
    "soulforge": "Aetheria",
    "resonance": "Elemental Manipulation",
    "intro": "Youngest daughter of the Thirty Seventh Everlight's Paragon, Ciarra Crownsworth grew up in a strict environent with great expectations from her peers. Thanks to the Paragon's ancestry, she naturally possesses the symbol of her race & Bastion, the ability to bend light to her will. Throughout her journey though, she has proven that she is more than that. Aside from light, she can also control every other natural element in the world, granting her the title of the Elemental Master. In the battlefield, she has also earned the nickname of the Silver-Haired Witch, but in contrast to the ominous name, she is one of the Four Great Beauties in Valhalla.",
    "abilities": [
        {
            "name": "Elementalist",
            "details": "As a master of all elements, Ciarra's abilities will alternate between <span>Arcane</span> mode and <span>Mystic</span> mode. In <span>Arcane</span> mode, her abilities will focus on protection and area control, while in <span>Mystic</span> mode, they will focus on magic damage.<br><br>When Ciarra uses her ability, she will fill up her Elemental Gauge. When the gauge is full, she will automatically switch to the other mode.<br><br>During <span>Arcane</span> mode, Ciarra will recover a small percentage of her <span class=\"ability-mp\">missing mana</span> every second. During <span>Mystic</span> mode, her abilities will deal additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>)."
        },
        {
            "name": "Arcanic Stone / Mystical Flare",
            "details": "During <span>Arcane</span> mode, Ciarra will cast a sharp stone in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to the first enemy hit. The stone will shatter upon impact and deal lesser magical damage to the enemies behind.<br><br>During <span>Mystic</span> mode, Ciarra will cast a blast of fire in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies in a small radius around the first enemy hit. "
        },
        {
            "name": "Arcanic Ice / Mystical Bolt",
            "details": "During <span>Arcane</span> mode, Ciarra will summon a blizzard in a target area, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and <span class=\"ability-debuff\">slowing</span> all enemies inside.<br><br>During <span>Mystic</span> mode, Ciarra will cast a lightning bolt that strike in a target area after a short delay, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and reducing their <span class=\"ability-mr\">resistance</span>."
        },
        {
            "name": "Arcanic Gale / Mystical Flora",
            "details": "During <span>Arcane</span> mode, Ciarra will cast a wind gale on a target path, increasing her and allies' <span class=\"ability-mv\">movement speed</span> for a short duration.<br><br>During <span>Mystic</span> mode, Ciarra will summon several sprouts on a target path. After a short duration, they will grow into thorns and grab onto all enemies within the area, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and <span class=\"ability-debuff\">rooting</span> them down for a short duration."
        },
        {
            "name": "Arcanic Light / Mystical Void",
            "details": "During <span>Arcane</span> mode, Ciarra will cast a field of light around herself, pushing all enemies out of the field and stopping all enemies who attempt to dash into or within the field. If a target is successfully interrupted, they will be dealt <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and <span class=\"ability-debuff\">knocked up</span> for a brief duration.<br><br>During <span>Mystic</span> mode, Ciarra will cast a shroud of darkness at a target area that constantly deals <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) for several seconds. The shroud will slowly <span class=\"ability-debuff\">expand, reducing vision</span> of all enemies within."
        }
    ],
    "config": {
        "char_width": 1000,
        "char_height": 760,
        "next_char": "ignite"
    }
}
