{
    "code": "Phoenix",
    "full_name": "Huǒ Fèngyīng",
    "first_name": "Fèngyīng",
    "last_name": "Huǒ",
    "title": "the Origin Flame",
    "bastion_name": "Huǒshén",
    "bastion_full": "Huǒshén, the Ember Masters",
    "bastion_short": "huoshen",
    "race": "Chìzú",
    "soulforge": "?",
    "resonance": "Origin Flame",
    "intro": "Fèngyīng is the current Paragon of Huǒshén, known by others as the Empress of Holy Fire. She is described by her people as a ruler with a kind heart and is very well received by them. However, she harnesses the primal fire that has the power to scorch all enemies to ashes. While her destructive power is immense, her most sacred power is rather the opposite - the power to bring life back.",
    "abilities": [
        {
            "name": "Origin Embers",
            "details": "Fèngyīng's abilities ignite enemy heroes, causing them to burn over time, taking [ap]magical damage[/] (scaling with [ap]magical power[/]) per tick.[n]At 4 stacks, <b>Origin Embers</b> consume all stacks to deal a burst of [ap]magical damage[/] (scaling with [ap]magical power[/]) and spread to nearby enemy heroes (adding 1 stack of <b>Origin Embers</b>).[n]If the enemy target dies before 4 stacks, the burst damage will trigger immediately. The same target cannot be applied with <b>Origin Embers</b> again for at least several seconds."
        },
        {
            "name": "Fiery Spirits",
            "details": "Fèngyīng launches a fire bird spirit to a target area, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) to all enemies hit.[n]She can cast this ability two more times before the ability goes on cooldown. Each cast has a timer that will put the ability on cooldowns if the next cast is not on time."
        },
        {
            "name": "Holy Flame",
            "details": "Fèngyīng ignites a small circular area on the ground, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) over time to enemies standing in it.[n]Allies (and Fèngyīng) standing in the flame will be [bf]healed[/] (scaling with [ap]magical power[/]) instead.[n]Additionally, enemies who are currently affected by <b>Origin Embers</b> will also have [db]reduced movement speed[/] when standing in the flame.[n]<b>Holy Flame</b> can only apply 1 stack of <b>Origin Embers</b> to each enemy per cast."
        },
        {
            "name": "Searing Wings",
            "details": "Fèngyīng releases a cone of fire like searing phoenix's wings, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) to all enemies caught within it and [db]pushing them back[/] a short distance."
        },
        {
            "name": "Phoenix Reborn",
            "details": "Upon activation, Fèngyīng will temporarily die, and become a stationary <span>Flame Egg[/] for a few seconds. She cannot move, attack, or cast abilities in this state.[n]When she first enters the <span>Flame Egg[/] state, her health will be reduced to the lowest limit, and is then regenerating at a rapid rate (this means that enemies can kill her during this state).[n]While in the <span>Flame Egg[/] state, holy fire surrounds her, dealing [ap]magical damage[/] (scaling with [ap]magical power[/]) and [bf]healing[/] (scaling with [ap]magical power[/]) nearby allies over the duration.[n]After the duration, the egg hatches. Fèngyīng is reborn at the egg's location with a percentage of her maximum health and mana."
        }
    ],
    "config": {
        "next_char": "everflame"
    }
}
