{
    "code": "Silver",
    "full_name": "Clair Wyvernsworn",
    "first_name": "Clair",
    "last_name": "Wyvernsworn",
    "title": "the Silver Valkyrie",
    "bastion_name": "Everlight",
    "bastion_full": "Everlight, the Dawn Bringers",
    "bastion_short": "everlight",
    "race": "Valorian",
    "soulforge": "?",
    "resonance": "Silver Crafting",
    "intro": "Coming soon.",
    "abilities": [
        {
            "name": "Silver Weave",
            "details": "Whenever Clair casts an ability, she receives a stack of <span>Silver Weave</span> (maximum three), granting her a <span class=\"ability-sh\">shield</span> that lasts for a few seconds (expire duration is per stack, but shield value cannot be stacked).<br><br>Clair can walk to a nearby ally hero and transfer the <span>Silver Weave</span> stack to them, granting them a <span class=\"ability-sh\">shield</span> as well.<br><br>Enemy heroes can also receive a stack of <span>Silver Weave</span>, causing them to take bonus <span class=\"ability-ap\">magical damage</span> when attacked by ally heroes' <span class=\"ability-debuff\">basic attacks</span>."
        },
        {
            "name": "Gleaming Lance",
            "details": "Clair thrusts her lance in a line, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies hit.<br><br>Enemy heroes struck by <span>Gleaming Lance</span> receive a stack of <span>Silver Weave</span>."
        },
        {
            "name": "Argent Charge",
            "details": "Clair targets an allied hero (or herself) and grants them a burst of <span class=\"ability-mv\">movement speed</span>. If Clair has a stack of <span>Silver Weave</span> on her, this ability will transfer one stack of <span>Silver Weave</span> to the target.<br><br>Using <span>Argent Charge</span> will generate a stack of <span>Silver Weave</span> due to Clair's passive, which can only be transferred after the cast (meaning this will not be transferred to the targeted ally via the casting of this ability)."
        },
        {
            "name": "Shimmer Burst",
            "details": "Clair releases a burst of silver energy in a cone, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies hit and <span class=\"ability-debuff\">slowing</span> them for a short duration.<br><br>If an enemy hit is marked with a stack of <span>Silver Weave</span>, they are <span class=\"ability-debuff\">stunned</span> instead of slowed."
        },
        {
            "name": "Sentinel's Embrace",
            "details": "Clair channels briefly, then slams her lance down, creating a massive silver dome at her location that persists for several seconds. Allied heroes inside the dome gain <span class=\"ability-buff\">damage reduction</span> from all sources.<br><br>In addition, all ally and enemy heroes will receive a stack of <span>Silver Weave</span> when entering the dome."
        }
    ]
}
