{
    "code": "Siren",
    "full_name": "Phraya Saranak",
    "first_name": "Phraya",
    "last_name": "Saranak",
    "title": "the Tidesong Enchanter",
    "bastion_name": "Nagaithis",
    "bastion_full": "Nagaithis, the Tide Callers",
    "bastion_short": "nagaithis",
    "race": "Naga",
    "soulforge": "?",
    "resonance": "?",
    "intro": "Phraya is the serene but fierce enchanter of the Sunken Bastion. While her husband, Nakaraj, represents the crushing weight of the depths, Phraya represents the life-giving and relentless nature of the currents. Dressed in flowing silks and jade jewelry that chimes like crashing waves, she orchestrates the battlefield to ensure her people and her Paragon never falter.",
    "abilities": [
        {
            "name": "Gift of the Sea",
            "details": "Phraya's damaging abilities apply a stack of <strong>Brine</strong> to enemies. Once the first stack is applied, allied heroes' basic attacks also apply a stack of <strong>Brine</strong> (1 stack per unique ability).<br><br>Upon reaching 4 stacks, the <strong>Brine</strong> detonates, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) and <span class=\"ability-buff\">healing</span> the last allied hero who damaged that enemy (or Phraya herself)."
        },
        {
            "name": "Cresting Tide",
            "details": "Nara sends a small, focused wave in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to all enemies it passes through and <span class=\"ability-debuff\">slowing</span> them for a short duration."
        },
        {
            "name": "Pearl Blessing",
            "details": "Phraya blesses a targeted ally with a shimmering water bubble, granting the ally a <span class=\"ability-sh\">shield</span> (scaling with <span class=\"ability-ap\">magical power</span>) and bonus <span class=\"ability-ms\">movement speed</span>.<br><br>If the shield is broken by an enemy, <strong>Cresting Tide</strong>'s cooldown is reduced by half."
        },
        {
            "name": "Spiraling Shoal",
            "details": "Phraya commands a spectral fish to swim in a circle around a target location for a few seconds, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-ap\">magical power</span>) to any enemy and <span class=\"ability-buff\">healing</span> (scaling with <span class=\"ability-ap\">magical power</span>) any ally it passes through.<br><br>While within the <strong>Deepwater Domain</strong>, the fish grows larger, dealing <span class=\"ability-buff\">increased damage</span> and <span class=\"ability-debuff\">knocking up</span> enemies hit by its initial pass."
        },
        {
            "name": "Deepwater Domain",
            "details": "Phraya chants an ancient hymn, transforming the surrounding area into a <strong>Deepwater Domain</strong> for a duration. During this time, allied heroes within the domain are <span class=\"ability-buff\">healed</span> (scaling with <span class=\"ability-ap\">magical power</span>) every second and <span class=\"ability-buff\">ignore unit collision</span>.<br><br>Phraya cannot move and use any abilities while chanting the hymn. In addition, her <strong>Spiraling Shoal</strong> is enhanced while the domain is active."
        }
    ],
    "config": {
        "prev_char": "leviathan"
    }
}