{
    "code": "Soulforger",
    "full_name": "Kharra-Ryn Tuta-Dam",
    "first_name": "Kharra-Ryn",
    "last_name": "Tuta-Dam",
    "title": "the Sun Carver",
    "bastion_name": "Durak-Tharn",
    "bastion_full": "Durak-Tharn, the Hearth Forgers",
    "bastion_short": "duraktharn",
    "race": "Dova-Ran",
    "soulforge": "?",
    "resonance": "?",
    "intro": "Kharra-Ryn, a determined young blacksmith, carries a pair of golden & molten hammers and is orbited by three glowing solar cores. She embodies the spirit of a living forge, capable of crafting the best Soulforges in the world.",
    "abilities": [
        {
            "name": "Living Forge",
            "details": "Kharra-Ryn carries the heart of a forge within her, allowing her to aid her allies' progression by contributing her own gold to their item purchases. Once every few minutes, Kharra-Ryn can <span>select an allied hero</span> and <span>choose an item</span> they are currently building. She can then spend a portion of her own <span class=\"ability-ar\">gold</span> to <span class=\"ability-buff\">contribute to that item's cost</span>.<br><br>Her gold contribution is added a small <span class=\"ability-ar\">bonus</span> when contributed to the ally's item completion progress, effectively giving her a personal reduced cost on the upgrade."
        },
        {
            "name": "Core Breach",
            "details": "Kharra-Ryn smashes one of her solar cores with a hammer, launching it in a line. The core deals <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) to the first enemy hit, slightly <span class=\"ability-debuff\">knocking back</span> the target and reducing their <span class=\"ability-debuff\">physical power</span> for a few seconds."
        },
        {
            "name": "Molten Impact",
            "details": "Kharra-Ryn imbues her hammers, causing her next three basic attacks within a few seconds to deal bonus <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-hp\">health</span>) and apply a stack of <span>Molten Impact</span> to the target.<br><br>Upon reaching three <span>Molten Impact</span> stacks, the target is dealt <span class=\"ability-ap\">magical damage</span> (scaling with the target's <span class=\"ability-hp\">health</span>) and gets <span class=\"ability-debuff\">stunned</span> for a short duration. The stacks are then removed and can be replied again after a short cooldowns per target."
        },
        {
            "name": "Foundry Force",
            "details": "Kharra-Ryn slams both of her hammers down simultaneously, creating a powerful shockwave around her, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) and briefly <span class=\"ability-debuff\">slowing</span> all enemies hit.<br><br>When <span>Foundry Force</span> hits an enemy who has at least one <span>Molten Impact</span> stack, it will immediately maximise the stacks to trigger the stun effect."
        },
        {
            "name": "Solar Cores",
            "details": "Kharra-Ryn send all of her <strong>Solar Cores</strong> to orbit around an ally hero.<br><br>Each of the cores can completely block 1 ability from the enemy heroes. Once 3 blocks are completed, the solar cores will return to Kharra-Ryn.<br><br>While the <strong>Solar Cores</strong> are away, Kharra-Ryn will have her own <span class=\"ability-debuff\">stats</span> reduced, and will not be able to use her <span>Core Breach</span> ability until the solar cores return to her."
        }
    ],
    "config": {
        "next_char": "ironbound"
    }
}
