{
    "code": "Thunder",
    "full_name": "Artorias Draconis",
    "first_name": "Artorias",
    "last_name": "Draconis",
    "title": "the Lightning Champion",
    "bastion_name": "Dragnoel",
    "bastion_full": "Dragnoel, the Dragon Knights",
    "bastion_short": "dragnoel",
    "race": "Dragonian",
    "soulforge": "Storm Breaker",
    "resonance": "Thunder Bending",
    "intro": "When the Primordial Dragon fell, its soul was shattered into six fragments of avatars that would later be referred to as the Dragon Knights, or the Draconis siblings. Artorias is the youngest sibling, wielding the elemental power of thunder. He loves to travel around the world and wrecking havoc everywhere, which cause a lot of headache to his older siblings.",
    "abilities": [
        {
            "name": "Thunder Fury",
            "details": "Every time Artorias basic attacks or uses <strong>Lightning Strike</strong> on an enemy hero, he receives a stack of <strong>Thunder Fury</strong> (maximum 5 stacks). A critical hit will grant him 2 stacks instead.<br><br>Each <strong>Thunder Fury</span> stack increases his <span class=\"ability-cr\">critical chance</span>. Artorias's critical chance can exceed 100%, and excessive critical chance will be converted to <span class=\"ability-cr\">critical strike damage</strong>.<br><br>At maximum stacks, Artorias's basic attack or <strong>Lightning Strike</strong> creates lightning that deals additional <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-cr\">critical strike damage</span>) to the target and nearby enemies."
        },
        {
            "name": "Lightning Strike",
            "details": "Artorias fires a blast of lightning in a target direction, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-cr\">critical strike damage</span>) to all enemies hit (<strong>Lightning Strike</strong> can critically strike).<br><br>In <strong>Thunder Dragon</strong> form, <strong>Lightning Strike</strong> has a slightly wider and longer range."
        },
        {
            "name": "Voltaic Body",
            "details": "Artorias gains increased <span class=\"ability-as\">attack speed</span> and <span class=\"ability-mv\">movement speed</span> that decays over a short duration.<br><br>In <strong>Thunder Dragon</strong> form, Artorias's basic attacks, <strong>Lightning Strike</strong> and chained lightning from <strong>Thunder Fury</strong> also reduce the target's <span class=\"ability-debuff\">magic resistance</span>."
        },
        {
            "name": "Galvanic Tip",
            "details": "Artorias leaps to a target direction and fires a lightning bolt at the nearest enemy (prioritising enemy hero), dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-cr\">critical strike damage</span>) and <span class=\"ability-debuff\">slowing</span> the target for a short duration.<br><br>In <strong>Thunder Dragon</strong> form, Artorias uses his tail to pierce at a target direction, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-cr\">critical strike damage</span>) to all enemies hit and greatly <span class=\"ability-debuff\">slowing</span> them down for the same duration."
        },
        {
            "name": "Storm Breaker",
            "details": "Artorias transforms into the powerful <strong>Thunder Dragon</strong>, gaining increased <span class=\"ability-buff\">size</span>, <span class=\"ability-mv\">movement speed</span> and maximum stacks of <strong>Thunder Fury</strong> for a duration.<br><br>While in <strong>Thunder Dragon</strong> form, Artorias will always <span class=\"ability-cr\">critically strike</span> with basic attacks and <strong>Lightning Strike</strong>. In addition, his critical chance will be converted to bonus <span class=\"ability-cr\">critical strike damage</span> instead.<br><br>While in <strong>Thunder Dragon</strong> form, his abilities are enhanced."
        }
    ],
    "config": {
        "prev_char": "flame"
    }
}
