{
    "code": "Windstrider",
    "full_name": "Zephyrus Draconis",
    "first_name": "Zephyrus",
    "last_name": "Draconis",
    "title": "the Sky Rider",
    "bastion_name": "Dragnoel",
    "bastion_full": "Dragnoel, the Dragon Knights",
    "bastion_short": "dragnoel",
    "race": "Dragonian",
    "soulforge": "Air Breaker",
    "resonance": "Wind Bending",
    "intro": "When the Primordial Dragon fell, its soul was shattered into six fragments of avatars that would later be referred to as the Dragon Knights, or the Draconis siblings. Zephyrus is the third sibling, wielding the elemental power of wind...",
    "abilities": [
        {
            "name": "Gale Blades",
            "details": "Zephyrus starts with 3 <strong>Gale Blades</strong>. He gains additional blades based on his bonus attack speed.<br><br>His blades orbit him closely, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-as\">attack speed</span>) to any enemy they pass through.<br><br>Each time he basic attacks, he uses 1 blade. His abilities can also use up all of his current blades.<br><br>When Zephyrus is out of blades, he is unable to <span class=\"ability-debuff\">basic attack</span>, use <strong>Razor Array</strong> or <strong>Cyclone Orbit</strong> until he regenerates more blades over time."
        },
        {
            "name": "Razor Array",
            "details": "Zephyrus commands all his current blades to strike a target location in a rapid sequence. Each blade deals <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-as\">attack speed</span>).<br><br>In <strong>Wind Dragon</strong> form, Zephyrus's blades stay on the enemies for a short duration and <strong>Razor Array</strong> can be recasted to return all blades from the enemies to Zephyrus, dealing additional <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-as\">attack speed</span>)."
        },
        {
            "name": "Cyclone Orbit",
            "details": "<strong>Cyclone Orbit</strong> is only usable while <strong>Sky Soar</strong> is active. When casted, Zephyrus locks onto a target enemy hero and begins flying in a circle around them.<br><br>While orbiting, Zephyrus automatically launches his blades at the target. Each blade deals <span class=\"ability-ad\">physical damage</span> on hit and immediately return to Zephyrus.<br><br>Zephyrus can choose either clockwise or anti-clockwise for the orbit direction. The firing rate of the blades scales directly with Zephyris's <span class=\"ability-as\">attack speed</span>.<br><br>In <strong>Wind Dragon</strong> form, the <span class=\"ability-buff\">orbital speed</span> is increased based on his Zephyrus's attack speed."
        },
        {
            "name": "Sky Soar",
            "details": "Zephyrus spreads his wings, gaining increased <span class=\"ability-ms\">movement speed</span> and the ability to <span class=\"ability-ms\">travel through terrain</span> for a duration.<br><br>In <strong>Wind Dragon</strong> form, <strong>Sky Soar</strong> is automatically activated and the flight duration remains <span class=\"ability-buff\">permanent</span> until the transformation ends."
        },
        {
            "name": "Air Breaker",
            "details": "Zephyrus transforms into the <strong>Wind Dragon</strong>, gaining increased <span class=\"ability-buff\">size</span>, <span class=\"ability-ms\">movement speed</span> and <span class=\"ability-as\">attack speed</span>.<br><br>In addition, his attack speed cap is <span class=\"ability-buff\">removed</span>.<br><br>While in <strong>Wind Dragon</strong> form, his abilities are enhanced."
        }
    ],
    "config": {
        "prev_char": "earthbreaker",
        "next_char": "tidecaller"
    }
}
