{
    "code": "Wrath",
    "full_name": "Huǒ Wǔjiàng",
    "first_name": "Wǔjiàng",
    "last_name": "Huǒ",
    "title": "the Undying Flame",
    "bastion_name": "Huǒshén",
    "bastion_full": "Huǒshén, the Ember Masters",
    "bastion_short": "huoshen",
    "race": "Chìzú",
    "soulforge": "Liánhuǒ",
    "resonance": "Undying Flame",
    "intro": "Wǔjiàng is named the strongest warrior in the history of Huoshen, the bastion of Chìzú. His resonance ability, the Undying Flame, originally belonged to the Paragon, Phoenix, but was shared to him when he defended the Bastion from one of the strongest Hellspawns, with the cost of his life. The flame resurrected him and fused with his original fire-bending ability. Since then, he continued to wield his Soulforge, Liánhuǒ, to defeat anyone who is foolish enough to harm the Bastion or the Empress of the Holy Fire, his saviour.",
    "abilities": [
        {
            "name": "Blazing Bulwark",
            "details": "Wǔjiàng generates an <span>Blazing Bulwark</span> stack whenever he takes damage from an enemy hero or deals damage with an ability or basic attack. If Wǔjiàng has a <span>Blazing Bulwark</span> stack, his body will be surrounding by flame, dealing <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-hp\">maximum health</span>) to nearby enemies per second.<br><br>Each stack increases the damage dealt. At maximum <span>Blazing Bulwark</span> stacks, each time the flame deals damage, it will <span class=\"ability-buff\">heal</span> Wujiang for a <span class=\"ability-buff\">percentage of the damage dealt</span>."
        },
        {
            "name": "Fearless Smash",
            "details": "Wǔjiàng leaps to a target enemy, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>).<br><br>At maximum <span>Blazing Bulwark</span> stacks, Fearless Smash will also deal damage to surrounding enemies in a small radius around the target, and slightly <span class=\"ability-debuff\">knock them back</span>."
        },
        {
            "name": "Inferno Fists",
            "details": "Wǔjiàng channels flame on his fists, empowering his basic attacks to deal <span class=\"ability-ap\">magical damage</span> (scaling with <span class=\"ability-hp\">maximum health</span>) to surrounding enemies in a small radius around the target.<br><br>At maximum <span>Blazing Bulwark</span> stacks, he gains <span class=\"ability-buff\">increased attack speed</span>."
        },
        {
            "name": "Seismic Kick",
            "details": "Wǔjiàng kicks the ground, dealing <span class=\"ability-ad\">physical damage</span> (scaling with <span class=\"ability-ad\">physical power</span>) to all nearby enemies in a small radius and slowing them for a short duration.<br><br>At maximum <span>Blazing Bulwark</span> stacks, the impact will first <span class=\"ability-debuff\">knock up</span> the enemies, before slowing them down."
        },
        {
            "name": "Undying Flame",
            "details": "Wǔjiàng embraces the blessing of the Phoenix, becoming a temporary avatar of pure, unyielding fire. He instantly gains <span class=\"ability-buff\">maximum</span> <span>Blazing Bulwark</span> stacks, and takes <span class=\"ability-buff\">reduced incoming damage</span> by a significant percentage for the next few seconds."
        }
    ],
    "config": {
        "char_width": 900,
        "char_height": 900
    }
}
