{
    "code": "Shadow",
    "full_name": "Grim",
    "first_name": "Grim",
    "last_name": "?",
    "title": "?",
    "bastion_name": "Altharion",
    "bastion_full": "Altharion, the Dusk Blades",
    "bastion_short": "altharion",
    "race": "Graveborn",
    "soulforge": "Twin Shadows",
    "resonance": "?",
    "intro": "Grim is the Paragon of Altharion, the Bastion of the Graveborns. He is known as the legendary hitman who exists between the physical world and the dead. Wielding two supernatural firearms named Twin Shadows, he executes his targets with rhythmic precision.",
    "abilities": [
        {
            "name": "Twin Shadows",
            "details": "Grim's basic attacks fire twice—once from each gun. The second shot deals a percentage of the first shot's damage as [ap]magical damage[/] and applies on-hit effects.<br><br>He will shoot the same target, else another target in range. The second shot is also affected by critical strike modifiers, but the critical chance is based on the first shot."
        },
        {
            "name": "Piercing Darkness",
            "details": "Grim fires a high-velocity shadow laser in a line, dealing [ad]physical damage[/] (scaling with [ad]physical power[/] and [ap]magical damage[/]) to all enemies hit."
        },
        {
            "name": "Dark Cloak",
            "details": "Grim flips his cloak, dealing [ad]physical damage[/] (scaling with [ad]physical power[/]) to all nearby enemies.<br><br><strong>Dark Cloak</strong> can [bf]deflect[/] incoming basic attacks and projectiles back."
        },
        {
            "name": "Dawning Shadow",
            "details": "Grim dashes a short distance, leaving a <strong>Shadow</strong> at his starting location for a few seconds. He can re-activate this ability to instantly return to the <strong>Shadow</strong>.<br><br>If Grim scores a takedown before returning, or within few seconds after returning, the cooldown of <strong>Dawning Shadow</strong> is [bf]reset[/]."
        },
        {
            "name": "Last Whisper",
            "details": "Grim launches a globule of shadow in a target direction that collides with the first enemy hero hit, afflicting them with a shadow that grows over the next few seconds.<br><br>The shadow will cause the enemy target to be [db]nearsighted[/], and also stores a portion of all damage Grim deals to the target.<br><br>At the end of the duration, the shadow detonates to deal [ad]physical damage[/] based on the stored damage."
        }
    ]
}